/* let space = 'local';
let API_URL;
if (space === 'local') {
  API_URL = `http://127.0.0.1:8000`;
} else if (space === 'host') {
  API_URL = `https://zed-games-api.onrender.com`;
}

export const api = {
  main: `${API_URL}/api`,
  items: `${API_URL}/api/items`,
  acts: `${API_URL}/api/acts`,
  emps: `${API_URL}/api/emps`,
  currency: `${API_URL}/api/currency`,
  points: `${API_URL}/api/points`,
  custs: `${API_URL}/api/custs`,
  login: `${API_URL}/api/users/login`,
  dash: `${API_URL}/api/dashboard`,
  users: `${API_URL}/api/dashboard/users`,
  codes: `${API_URL}/api/dashboard/codes`,
  tests: `${API_URL}/api/dashboard/tests`,
  bank: `${API_URL}/api/dashboard/bank`,

  main_stats: `${API_URL}/api/dashboard/stats/main`,
  month_stats: `${API_URL}/api/dashboard/stats/month`,
  users_stats: `${API_URL}/api/dashboard/stats/users`,
  codes_stats: `${API_URL}/api/dashboard/stats/codes`,
  tests_stats: `${API_URL}/api/dashboard/stats/tests`,
};
 */

export const the_data = [
  {
    name: 'المرحلة الابتدائية',
    id: 1,
    label: 'اختر الصف',
    content: [
      {
        name: 'الصف الأول الابتدائي',
        label: 'اختر الفصل',
        id: 1,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [{ h2: 'مقرر_لغتي_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  {
                    h2: 'مقرر_الدراسات_الاسلامية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'الصف الثاني الابتدائي',
        label: 'اختر الفصل',
        id: 2,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [{ h2: 'لغتي_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  {
                    h2: 'مقرر_الدراسات_الاسلامية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'الصف الثالث الابتدائي',
        label: 'اختر الفصل',
        id: 3,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [{ h2: 'لغتي_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              /*               {
                title: 'الرياضيات',
                books: [
                ],
              }, */
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  {
                    h2: 'مقرر_الدراسات_الاسلامية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'الصف الرابع الابتدائي',
        label: 'اختر الفصل',
        id: 4,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الجميلة_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              /*               {
                title: 'الرياضيات',
                books: [
                  { h2: 'مقرر الرياضيات / كتاب التمارين' },
                  { h2: 'مقرر الرياضيات / كتاب الطالب الجزء الثاني' },
                ],
              }, */
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              } /* 
              {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر التربية الفنية / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر Top Goal1 /كتاب الطالب' },
                  { h2: 'Audio Files TG1' },
                ],
              },*/,
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'مقرر_التجويد_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [
                  { h2: 'مقرر_الدراسات_الاجتماعية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'المهارات الرقمية',
                books: [
                  { h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  { h2: 'مقرر_الدراسات_الإسلامية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'الصف الخامس الابتدائي',
        label: 'اختر الفصل',
        id: 5,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الجميلة_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              /*               {
                title: 'الرياضيات',
                books: [
                  { h2: 'مقرر الرياضيات / كتاب التمارين' },
                  { h2: 'مقرر الرياضيات / كتاب الطالب الجزء الثاني' },
                ],
              }, */
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'مقرر_التجويد_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [
                  { h2: 'مقرر_الدراسات_الاجتماعية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'المهارات الرقمية',
                books: [
                  { h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  {
                    h2: 'مقرر_الدراسات_الإسلامية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              /* {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر التربية الفنية / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              
              {
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر Top Goal2 /كتاب الطالب' },
                  { h2: 'Audio Files TG2' },
                ],
              }, */
            ],
          },
        ],
      },
      {
        name: 'الصف السادس الابتدائي',
        label: 'اختر الفصل',
        id: 6,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الجميلة_-_كتاب_الطالب_الجزء_الثاني',
                    url: '',
                  },
                ],
              },
              /* {
                title: 'الرياضيات',
                books: [
                  { h2: 'مقرر الرياضيات / كتاب التمارين' },
                  { h2: 'مقرر الرياضيات / كتاب الطالب الجزء الثاني' },
                ],
              }, */
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              },
              /* {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر التربية الفنية / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },{
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر Top Goal2 /كتاب الطالب' },
                  { h2: 'Audio Files TG2' },
                ],
              }, */
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'مقرر_التجويد_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [
                  { h2: 'مقرر_الدراسات_الاجتماعية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'المهارات الرقمية',
                books: [
                  { h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  {
                    h2: 'مقرر_الدراسات_الإسلامية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
            ],
          },
        ],
      },
    ],
  },
  {
    name: 'المرحلة المتوسطة',
    id: 2,
    label: 'اختر الصف',
    content: [
      {
        name: 'الصف الأول المتوسط',
        label: 'اختر الفصل',
        id: 1,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الخالدة_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'مقرر_العلوم_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              /* {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر التربية الفنية / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر المهارات الحياتية والأسرية / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'كتاب الطالب/ التجويد (التحفيظ)' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [{ h2: 'مقرر الدراسات الاجتماعية / كتاب الطالب' }],
              },
              {
                title: 'المهارات الرقمية',
                books: [{ h2: 'المهارات الرقمية/ كتاب الطالب' }],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [{ h2: 'مقرر الدراسات الاسلامية / كتاب الطالب' }],
              },
              {
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر SUPER GOAL1 /كتاب الطالب' },
                  { h2: 'Audio Files Super Goal 1' },
                ],
              },
              {
                title: 'اللغة الصينية',
                books: [{ h2: 'مقرر Chinese Language / كتاب الطالب' }],
              }, */
            ],
          },
        ],
      },
      {
        name: 'الصف الثاني المتوسط',
        label: 'اختر الفصل',
        id: 2,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الخالدة_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'مقرر_العلوم_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر_التربية_الفنية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },

              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'مقرر_التجويد_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'المهارات الرقمية',
                books: [
                  { h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              /*
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر المهارات الحياتية والأسرية / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [{ h2: 'مقرر الدراسات الاجتماعية / كتاب الطالب' }],
              },
              
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [{ h2: 'مقرر الدراسات الاسلامية / كتاب الطالب' }],
              },
              {
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر SUPER GOAL2 /كتاب الطالب' },
                  { h2: 'Audio Files Super Goal 2' },
                ],
              }, */
            ],
          },
        ],
      },
      {
        name: 'الصف الثالث المتوسط',
        label: 'اختر الفصل',
        id: 3,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الخالدة_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'مقرر_العلوم_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              /* {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر التربية الفنية / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر المهارات الحياتية والأسرية / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'كتاب الطالب/ التجويد (التحفيظ)' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [{ h2: 'مقرر الدراسات الاجتماعية / كتاب الطالب' }],
              },
              {
                title: 'المهارات الرقمية',
                books: [{ h2: 'المهارات الرقمية/ كتاب الطالب' }],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [{ h2: 'مقرر الدراسات الاسلامية / كتاب الطالب' }],
              },
              {
                title: 'التفكير الناقد',
                books: [{ h2: 'مقرر التفكير الناقد / كتاب الطالب' }],
              },
              {
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر SUPER GOAL3 /كتاب الطالب' },
                  { h2: 'Audio Files Super Goal 3' },
                ],
              }, */
            ],
          },
        ],
      },
    ],
  },
  {
    name: 'الثانوية العامة',
    id: 3,
    label: 'اختر المسار',
    content: [
      {
        name: 'السنة الأولى المشتركة',
        label: 'اختر الفصل',
        id: 1,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              /* {
                title: 'التقنية الرقمية 1',
                books: [{ h2: 'مقرر التقنية الرقمية1 / كتاب الطالب' }],
              },
              {
                title: 'الرياضيات 1',
                books: [
                  { h2: 'مقرر الرياضيات 1-1 / كتاب التمارين' },
                  {
                    h2: 'مقرر الرياضيات 1-1 / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'اللغة الإنجليزية 1',
                books: [
                  { h2: 'مقرر MEGA GOAL 1 / كتاب الطالب' },
                  { h2: 'Audio Files Mega Goal 1' },
                ],
              },
              {
                title: 'الكيمياء 1',
                books: [
                  { h2: 'مقرر كيمياء 1 / دليل التجارب العلمية' },
                  { h2: 'مقرر الكيمياء 1 / كتاب الطالب' },
                ],
              },
              {
                title: 'الأحياء 1',
                books: [
                  { h2: 'مقرر الأحياء 1 / دليل التجارب العلمية' },
                  { h2: 'مقرر الأحياء 1 / كتاب الطالب' },
                ],
              },
              {
                title: 'الكفايات اللغوية 1',
                books: [
                  {
                    h2: 'مقرر الكفايات اللغوية 1-1 / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'التربية المهنية',
                books: [{ h2: 'مقرر التربية المهنية/ كتاب الطالب' }],
              },
              {
                title: 'علم البيئة',
                books: [
                  { h2: 'مقرر علم البيئة / دليل التجارب العلمية' },
                  { h2: 'مقرر علم البيئة / كتاب الطالب' },
                ],
              },
              {
                title: 'الفيزياء 1',
                books: [
                  { h2: 'مقرر الفيزياء 1 / دليل التجارب العلمية' },
                  { h2: 'مقرر الفيزياء 1 / كتاب الطالب' },
                ],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [{ h2: 'مقرر الدراسات الاجتماعية / كتاب الطالب' }],
              },
              {
                title: 'الحديث 1',
                books: [{ h2: 'مقرر الحديث 1 / كتاب الطالب' }],
              },
              {
                title: 'القرآن الكريم وتفسيره',
                books: [{ h2: 'مقرر القرآن الكريم وتفسيره / كتاب الطالب' }],
              },
              {
                title: 'التفكير الناقد',
                books: [{ h2: 'مقرر التفكير الناقد / كتاب الطالب' }],
              },
              {
                title: 'المعرفة المالية',
                books: [
                  { h2: 'مقرر المعرفة المالية / كتاب الطالب' },
                  { h2: 'financial Literacy / Student book' },
                ],
              }, */
            ],
          },
        ],
      },
      {
        name: 'المسار العام',
        label: 'اختر الصف',
        id: 2,
        content: [
          {
            name: 'السنة الثانية',
            label: 'اختر الفصل',
            id: 1,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [
                  {
                    title: 'الرياضيات 2',
                    books: [
                      { h2: 'مقرر_الرياضيات_2-2_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                  {
                    title: 'الفيزياء 2',
                    books: [
                      { h2: 'مقرر_الفيزياء_2_-_كتاب_الطالب_الحزء_الثاني' },
                    ],
                  },
                  {
                    title: 'الكيمياء 2',
                    books: [
                      { h2: 'مقرر_الكيمياء_2-2_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                  {
                    title: 'الأحياء 2',
                    books: [
                      { h2: 'مقرر_الأحياء_2-2_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: 'السنة الثالثة',
            label: 'اختر الفصل',
            id: 2,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [
                  {
                    title: 'الرياضيات 3',
                    books: [
                      { h2: 'مقرر_الرياضيات_2-3_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                  {
                    title: 'الفيزياء 3',
                    books: [
                      { h2: 'مقرر_الفيزياء_2-3_-_كتاب_الطالب_الحزء_الثاني' },
                    ],
                  },
                  {
                    title: 'الكيمياء 3',
                    books: [
                      { h2: 'مقرر_الكيمياء_3_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                  {
                    title: 'علوم الأرض والفضاء',
                    books: [
                      {
                        h2: 'مقرر_علوم_الأرض_والفضاء_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'المسار الشرعي',
        label: 'اختر الصف',
        id: 3,
        content: [
          {
            name: 'السنة الثانية',
            label: 'اختر الفصل',
            id: 1,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
          {
            name: 'السنة الثالثة',
            label: 'اختر الفصل',
            id: 2,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
        ],
      },
      {
        name: 'المسار إدارة أعمال',
        label: 'اختر الصف',
        id: 4,
        content: [
          {
            name: 'السنة الثانية',
            label: 'اختر الفصل',
            id: 1,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
          {
            name: 'السنة الثالثة',
            label: 'اختر الفصل',
            id: 2,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
        ],
      },
      {
        name: 'مسار علوم الحاسب',
        label: 'اختر الصف',
        id: 5,
        content: [
          {
            name: 'السنة الثانية',
            label: 'اختر الفصل',
            id: 1,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
          {
            name: 'السنة الثالثة',
            label: 'اختر الفصل',
            id: 2,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
        ],
      },
      {
        name: 'مسار الصحة والحياة',
        label: 'اختر الصف',
        id: 6,
        content: [
          {
            name: 'السنة الثانية',
            label: 'اختر الفصل',
            id: 1,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
          {
            name: 'السنة الثالثة',
            label: 'اختر الفصل',
            id: 2,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
        ],
      },
    ],
  },
  {
    name: 'التعليم المستمر',
    id: 4,
    label: 'اختر الصف',
    content: [
      {
        name: 'الصف الأول',
        label: 'اختر الفصل',
        id: 1,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              /* {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر لغتي / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'الرياضيات / كتاب الطالب' }],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [{ h2: 'مقرر الدراسات الإسلامية / كتاب الطالب' }],
              },
              {
                title: 'المهارات الحياتية',
                books: [{ h2: 'المهارات الحياتية / كتاب الطالب' }],
              },
              {
                title: 'التربية الفنية',
                books: [{ h2: 'مقرر التربية الفنية/ كتاب الطالب' }],
              }, */
            ],
          },
        ],
      },
      {
        name: 'الصف الثاني',
        label: 'اختر الفصل',
        id: 2,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              /* {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر لغتي / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'الرياضيات / كتاب الطالب' }],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [{ h2: 'مقرر الدراسات الإسلامية / كتاب الطالب' }],
              },
              {
                title: 'المهارات الحياتية',
                books: [{ h2: 'المهارات الحياتية / كتاب الطالب' }],
              },
              {
                title: 'التربية الفنية',
                books: [{ h2: 'مقرر التربية الفنية/ كتاب الطالب' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'مقرر العلوم / كتاب الطالب' }],
              },
              {
                title: 'اللغة الانجليزية',
                books: [{ h2: 'مقرر اللغة الانجليزية /كتاب الطالب' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [{ h2: 'مقرر الدراسات الاجتماعية / كتاب الطالب' }],
              }, */
            ],
          },
        ],
      },
      {
        name: 'الصف الثالث',
        label: 'اختر الفصل',
        id: 3,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              /* {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر لغتي / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'الرياضيات / كتاب الطالب' }],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  { h2: 'مقرر الدراسات الإسلامية / كتاب الطالب' },
                  {
                    h2: 'مقرر تلاوة القرآن الكريم و تجويده / كتاب الطالب',
                    url: '',
                  },
                ],
              },
              {
                title: 'المهارات الحياتية',
                books: [{ h2: 'المهارات الحياتية / كتاب الطالب' }],
              },
              {
                title: 'التربية الفنية',
                books: [{ h2: 'مقرر التربية الفنية/ كتاب الطالب' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'مقرر العلوم / كتاب الطالب' }],
              },
              {
                title: 'اللغة الانجليزية',
                books: [{ h2: 'مقرر اللغة الانجليزية /كتاب الطالب' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [{ h2: 'مقرر الدراسات الاجتماعية / كتاب الطالب' }],
              },
              {
                title: 'الحاسب وتقنية المعلومات',
                books: [{ h2: 'مقرر الحاسب وتقنية المعلومات / كتاب الطالب' }],
              }, */
            ],
          },
        ],
      },
    ],
  },
  /*   {
    name: 'التربية الخاصة',
    id: 5,
    label: 'اختر الصف',
    content: [{ name: '', content: [] }],
  }, */
];
