let space = 'host';
let API_URL;
if (space === 'local') {
  API_URL = `http://127.0.0.1:8000`;
} else if (space === 'host') {
  API_URL = `https://dodgerblue-hare-961879.hostingersite.com`;
  // dodgerblue-hare-961879.hostingersite.com.
}

export const api = {
  main: `${API_URL}/api`,
  visits: `${API_URL}/api/visits`,
  inc_vis: `${API_URL}/api/visits/increment`,
  stats_vis: `${API_URL}/api/visits/stats`,

  anse: `${API_URL}/api/anses`,
};

export const quizzes = [
  {
    id: 0,
    title: 'مراجعة ختامية لعلوم ثالث متوسط – الفصل الأول (إعداد صابر السيالي)',
    questions: [
      /* ===================== */
      /* السؤال الأول: اختر الإجابة الصحيحة (1 → 24) */
      /* ===================== */

      {
        id: 1,
        type: 'mcq',
        question: 'أي مما يلي يمثل الخطوة الثانية لحل المشكلات؟',
        options: [
          'تحديد المشكلة',
          'الاستنتاج',
          'اختبار الفرضية',
          'فرض الفرضية',
        ],
        correctAnswer: 3,
      },
      {
        id: 2,
        type: 'mcq',
        question: 'كل صفة وراثية مسؤول عنها زوج من الجينات يسمى:',
        options: ['مربع بانيت', 'الأيض', 'الإنزيمات', 'الأليل'],
        correctAnswer: 3,
      },
      {
        id: 3,
        type: 'mcq',
        question:
          'عند تحلل عنصر الأميرسيوم بإطلاق جسيمات ألفا يتحول إلى عنصر النبتونيوم، فما عدد نيوتروناته؟',
        options: ['90', '95', '144', '148'],
        correctAnswer: 2,
      },
      {
        id: 4,
        type: 'mcq',
        question: 'أطول الموجات الزلزالية وأقلها سرعة هي:',
        options: [
          'الموجات الأولية',
          'الموجات الثانوية',
          'الموجات الجامعية',
          'الموجات السطحية',
        ],
        correctAnswer: 3,
      },
      {
        id: 5,
        type: 'mcq',
        question: 'موجات زلزالية مائية تكونت بفعل حدوث زلزال تحت المحيط:',
        options: [
          'الموجات الأولية',
          'الموجات الثانوية',
          'الموجات السطحية',
          'التسونامي',
        ],
        correctAnswer: 3,
      },
      {
        id: 6,
        type: 'mcq',
        question: 'كبيرة الحجم وثورانها ضعيف:',
        options: [
          'البراكين المركبة',
          'البراكين العامودية',
          'البراكين الدرعية',
          'البراكين المخروطية',
        ],
        correctAnswer: 2,
      },
      {
        id: 7,
        type: 'mcq',
        question: 'أسفل الستار طبقة لدنة تسمى:',
        options: [
          'الغلاف الصخري',
          'الغلاف القشري',
          'الغلاف المائي',
          'الغلاف المائع',
        ],
        correctAnswer: 3,
      },
      {
        id: 8,
        type: 'mcq',
        question:
          'وظيفته النفاذية الاختيارية ويسمح بدخول بعض المواد ويمنع بعضها:',
        options: ['النواة', 'النوية', 'الغشاء البلازمي', 'السيتوبلازم'],
        correctAnswer: 2,
      },
      {
        id: 9,

        type: 'mcq',
        question: 'ما نوع البحث الذي يجيب عن الأسئلة باختبار الفرضية؟',
        options: [
          'البحث التقني',
          'البحث الوصفي',
          'البحث التحليلي',
          'البحث التجريبي',
        ],
        correctAnswer: 3,
      },
      {
        id: 10,
        type: 'mcq',
        question: 'عندما يتساوى عدد الجزيئات في مادة ما في مكانين يسمى:',
        options: ['أيض', 'تخمر', 'اتزان', 'بلعمة'],
        correctAnswer: 2,
      },
      {
        id: 11,
        type: 'mcq',
        question: 'مخلوقات قادرة على صنع غذائها بنفسها هي:',
        options: ['الإنسان', 'الدجاج', 'النخلة', 'النحلة'],
        correctAnswer: 2,
      },
      {
        id: 12,
        type: 'mcq',
        question:
          'عملية يتم من خلالها الحصول على الطاقة المختزنة دون الحاجة إلى الأكسجين:',
        options: ['البلعمة', 'الإخراج الخلوي', 'التخمر', 'التنفس الخلوي'],
        correctAnswer: 2,
      },
      {
        id: 13,
        type: 'mcq',
        question: 'ما القاعدة النيتروجينية التي توجد في RNA ولا توجد في DNA؟',
        options: ['الأدينين', 'اليوراسيل', 'الجوانين', 'السايتوسين'],
        correctAnswer: 1,
      },
      {
        id: 14,
        type: 'mcq',
        question: 'خلايا الجسم التي لا تنقسم أبداً هي:',
        options: [
          'خلايا الجلد',
          'خلايا الدم البيضاء',
          'الخلايا العصبية',
          'خلايا الشعر',
        ],
        correctAnswer: 2,
      },
      {
        id: 15,
        type: 'mcq',
        question: 'يتكاثر حيوان الهيدرا لاجنسياً عن طريق:',
        options: ['الانشطار', 'التجدد', 'التبرعم', 'الإخصاب'],
        correctAnswer: 2,
      },
      {
        id: 16,
        type: 'mcq',
        question:
          'إذا كان عدد الكتلة لعنصر الفلور 19 وعدد النيترونات 10 فإن العدد الذري يساوي:',
        options: ['8', '9', '29', '19'],
        correctAnswer: 1,
      },
      {
        id: 17,

        type: 'mcq',
        question: 'الطور الذي تنفصل فيه الكروماتيدات في دورة الخلية هو:',
        options: ['البيني', 'التمهيدي', 'الانفصالي', 'النهائي'],
        correctAnswer: 2,
      },
      {
        id: 18,
        type: 'mcq',
        question: 'انحرافات تحدث أحياناً أثناء عملية نسخ DNA تسمى:',
        options: ['الوراثة', 'الطفرة', 'الأحماض الأمينية', 'الكروموسومات'],
        correctAnswer: 1,
      },
      {
        id: 19,
        type: 'mcq',
        question: 'الصفة التي تظهر وتخفي تأثير الصفة الأخرى تسمى:',
        options: ['الطفرة', 'السائدة', 'المتنحية', 'الهجينة'],
        correctAnswer: 1,
      },
      {
        id: 20,
        type: 'mcq',
        question: 'أي الجينات التالية تمثل صفة نقية متنحية؟',
        options: ['Tt', 'TT', 'tt', 'GG'],
        correctAnswer: 2,
      },
      {
        id: 21,
        type: 'mcq',
        question: 'مجموعات العناصر التي عددها من 3 إلى 12 تسمى:',
        options: [
          'العناصر الممثلة',
          'الغازات النبيلة',
          'العناصر الانتقالية',
          'الهالوجينات',
        ],
        correctAnswer: 2,
      },
      {
        id: 22,

        type: 'mcq',
        question: 'عملية ينتج عنها الجلوكوز والأكسجين:',
        options: [
          'الانتشار',
          'الانتشار المدعوم',
          'الخاصية الأسموزية',
          'التنفس الخلوي',
        ],
        correctAnswer: 3,
      },
      {
        id: 23,
        type: 'mcq',
        question: 'العناصر التي تنتمي إلى ثلاثية الحديد هي الحديد والكوبالت و:',
        options: ['النحاس', 'الأمريسيوم', 'النيكل', 'الفسفور'],
        correctAnswer: 2,
      },
      {
        id: 24,
        type: 'mcq',
        question:
          'أي مجموعات العناصر التالية تتحد سريعاً مع العناصر الأخرى لتكون مركبات؟',
        options: [
          'الفلزات القلوية',
          'الفلزات الانتقالية',
          'الغازات النبيلة',
          'ثلاثية الحديد',
        ],
        correctAnswer: 0,
      },

      /* ===================== */
      /* السؤال الثاني: صح / خطأ (25 → 31) */
      /* ===================== */

      {
        id: 25,
        type: 'true_false',
        question:
          'النظائر هي ذرات للعنصر نفسه لها نفس عدد البروتونات وتختلف في عدد النيوترونات.',
        options: ['صح', 'خطأ'],
        correctAnswer: 0,
      },
      {
        id: 26,
        type: 'true_false',
        question: 'النظرية العلمية دائماً تكون صحيحة.',
        options: ['صح', 'خطأ'],
        correctAnswer: 0,
      },
      {
        id: 27,
        type: 'true_false',
        question:
          'الانتشار المدعوم عملية تستعمل فيها الخلية الطاقة لنقل المواد.',
        options: ['صح', 'خطأ'],
        correctAnswer: 1,
      },
      {
        id: 28,
        type: 'true_false',
        question: 'يتكون الجدول الدوري الحديث من سبع دورات و18 مجموعة.',
        options: ['صح', 'خطأ'],
        correctAnswer: 0,
      },
      {
        id: 29,
        type: 'true_false',
        question:
          'عناصر المجموعة الثانية في الجدول الدوري تسمى الفلزات القلوية الأرضية.',
        options: ['صح', 'خطأ'],
        correctAnswer: 0,
      },
      {
        id: 30,
        type: 'true_false',
        question: 'تزاوج TT مع tt ينتج نباتات طويلة فقط (Tt).',
        options: ['صح', 'خطأ'],
        correctAnswer: 0,
      },
      {
        id: 31,
        type: 'true_false',
        question:
          'يستخدم البورون في صناعة أوعية الطهي التي تنقل مباشرة من الثلاجة إلى الفرن.',
        options: ['صح', 'خطأ'],
        correctAnswer: 0,
      },
      {
        id: 32,
        type: 'true_false',
        question: 'الهالوجينات تعني مكونات الغاز.',
        options: ['صح', 'خطأ'],
        correctAnswer: 1,
      },
      {
        id: 33,
        type: 'true_false',
        question: 'ميركالي هو الجهاز المستخدم لقياس شدة الزلازل.',
        options: ['صح', 'خطأ'],
        correctAnswer: 0,
      },
      {
        id: 34,
        type: 'true_false',
        question: 'جبل القدر بركان غير مركب.',
        options: ['صح', 'خطأ'],
        correctAnswer: 1,
      },
      {
        id: 35,
        type: 'true_false',
        question: 'جبل القدر بركان غير مركب.',
        options: ['صح', 'خطأ'],
        correctAnswer: 1,
      },
      {
        id: 36,
        type: 'true_false',
        question:
          'النيوترون جسيم غير مشحون له كتلة البروتون و يوجد في نواة الذرة.',
        options: ['صح', 'خطأ'],
        correctAnswer: 0,
      },
      {
        id: 37,
        type: 'true_false',
        question: 'التابع هو المتغير الذي لا يمكن قياسه في التجربة.',
        options: ['صح', 'خطأ'],
        correctAnswer: 1,
      },
      {
        id: 38,
        type: 'true_false',
        question: 'حرة البرك بركان مخروطي.',
        options: ['صح', 'خطأ'],
        correctAnswer: 0,
      },
      {
        id: 39,
        type: 'true_false',
        question:
          'اللون الأخضر في تجربة الأشعة المهبطية عبارة عن جسيمات سالبة الشحنة.',
        options: ['صح', 'خطأ'],
        correctAnswer: 0,
      },
      {
        id: 40,
        type: 'true_false',
        question: 'الخلايا العصبية خلايا قابلة للانقسام.',
        options: ['صح', 'خطأ'],
        correctAnswer: 1,
      },
    ],
  },
];

export const the_data = [
  {
    name: 'المرحلة الابتدائية',
    id: 1,
    label: 'اختر الصف',
    content: [
      {
        name: 'الصف الأول الابتدائي',
        label: 'اختر الفصل',
        id: 1,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [{ h2: 'مقرر_لغتي_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  {
                    h2: 'مقرر_الدراسات_الاسلامية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'الصف الثاني الابتدائي',
        label: 'اختر الفصل',
        id: 2,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [{ h2: 'لغتي_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  {
                    h2: 'مقرر_الدراسات_الاسلامية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'الصف الثالث الابتدائي',
        label: 'اختر الفصل',
        id: 3,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [{ h2: 'لغتي_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              /*               {
                title: 'الرياضيات',
                books: [
                ],
              }, */
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  {
                    h2: 'مقرر_الدراسات_الاسلامية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'الصف الرابع الابتدائي',
        label: 'اختر الفصل',
        id: 4,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الجميلة_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              /*               {
                title: 'الرياضيات',
                books: [
                  { h2: 'مقرر الرياضيات / كتاب التمارين' },
                  { h2: 'مقرر الرياضيات / كتاب الطالب الجزء الثاني' },
                ],
              }, */
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              } /* 
              {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر التربية الفنية / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر Top Goal1 /كتاب الطالب' },
                  { h2: 'Audio Files TG1' },
                ],
              },*/,
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'مقرر_التجويد_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [
                  { h2: 'مقرر_الدراسات_الاجتماعية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'المهارات الرقمية',
                books: [
                  { h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  { h2: 'مقرر_الدراسات_الإسلامية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'الصف الخامس الابتدائي',
        label: 'اختر الفصل',
        id: 5,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الجميلة_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'مقرر_التجويد_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [
                  { h2: 'مقرر_الدراسات_الاجتماعية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'المهارات الرقمية',
                books: [
                  { h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  {
                    h2: 'مقرر_الدراسات_الإسلامية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              /* {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر التربية الفنية / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              
              {
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر Top Goal2 /كتاب الطالب' },
                  { h2: 'Audio Files TG2' },
                ],
              }, */
            ],
          },
        ],
      },
      {
        name: 'الصف السادس الابتدائي',
        label: 'اختر الفصل',
        id: 6,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الجميلة_-_كتاب_الطالب_الجزء_الثاني',
                    url: '',
                  },
                ],
              },
              /* {
                title: 'الرياضيات',
                books: [
                  { h2: 'مقرر الرياضيات / كتاب التمارين' },
                  { h2: 'مقرر الرياضيات / كتاب الطالب الجزء الثاني' },
                ],
              }, */
              {
                title: 'العلوم',
                books: [{ h2: 'كتاب_العلوم_-_الجزء_الثاني' }],
              },
              /* {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر التربية الفنية / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },{
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر Top Goal2 /كتاب الطالب' },
                  { h2: 'Audio Files TG2' },
                ],
              }, */
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_والأسرية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'مقرر_التجويد_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [
                  { h2: 'مقرر_الدراسات_الاجتماعية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'المهارات الرقمية',
                books: [
                  { h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  {
                    h2: 'مقرر_الدراسات_الإسلامية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
            ],
          },
        ],
      },
    ],
  },
  {
    name: 'المرحلة المتوسطة',
    id: 2,
    label: 'اختر الصف',
    content: [
      {
        name: 'الصف الأول المتوسط',
        label: 'اختر الفصل',
        id: 1,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الخالدة_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'مقرر_العلوم_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر_التربية_الفنية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'مقرر_التجويد_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [
                  { h2: 'مقرر_الدراسات_الاجتماعية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'المهارات الرقمية',
                books: [
                  { h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  { h2: 'مقرر_الدراسات_الإسلامية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر_اللغة_الإنغليزية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'الصف الثاني المتوسط',
        label: 'اختر الفصل',
        id: 2,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الخالدة_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'مقرر_العلوم_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر_التربية_الفنية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },

              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'مقرر_التجويد_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'المهارات الرقمية',
                books: [
                  { h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [
                  { h2: 'مقرر_الدراسات_الاجتماعية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },

              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  { h2: 'مقرر_الدراسات_الإسلامية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر_اللغة_الإنغليزية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'الصف الثالث المتوسط',
        label: 'اختر الفصل',
        id: 3,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر_لغتي_الخالدة_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'مقرر_العلوم_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'التربية الفنية',
                books: [
                  {
                    h2: 'مقرر_التربية_الفنية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'المهارات الحياتية والأسرية',
                books: [
                  {
                    h2: 'مقرر_المهارات_الحياتية_-_كتاب_الطالب_الجزء_الثاني',
                  },
                ],
              },
              {
                title: 'التجويد (التحفيظ)',
                books: [{ h2: 'مقرر_التجويد_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [
                  { h2: 'مقرر_الدراسات_الاجتماعية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'المهارات الرقمية',
                books: [
                  { h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  { h2: 'مقرر_الدراسات_الإسلامية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'التفكير الناقد',
                books: [
                  { h2: 'مقرر_التفكير_الناقد_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'اللغة الإنجليزية',
                books: [
                  { h2: 'مقرر_اللغة_الإنغليزية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
            ],
          },
        ],
      },
    ],
  },
  {
    name: 'الثانوية العامة',
    id: 3,
    label: 'اختر المسار',
    content: [
      {
        name: 'السنة الأولى المشتركة',
        label: 'اختر الفصل',
        id: 1,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              {
                title: 'التفكير الناقد',
                books: [
                  { h2: 'مقرر_التفكير_الناقد_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'التربية المهنية',
                books: [
                  { h2: 'مقرر_التربية_المهنية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [
                  { h2: 'مقرر_الدراسات_الاجتماعية_-_كتاب_الطالب_الجزء_الثاني' },
                ],
              },
              {
                title: 'الحديث 1',
                books: [{ h2: 'مقرر_الحديث_-_كتاب_الطالب_الجزء_الثاني' }],
              },
              /* {
                title: 'التقنية الرقمية 1',
                books: [{ h2: 'مقرر التقنية الرقمية1 / كتاب الطالب' }],
              },
              {
                title: 'الرياضيات 1',
                books: [
                  { h2: 'مقرر الرياضيات 1-1 / كتاب التمارين' },
                  {
                    h2: 'مقرر الرياضيات 1-1 / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'اللغة الإنجليزية 1',
                books: [
                  { h2: 'مقرر MEGA GOAL 1 / كتاب الطالب' },
                  { h2: 'Audio Files Mega Goal 1' },
                ],
              },
              {
                title: 'الكيمياء 1',
                books: [
                  { h2: 'مقرر كيمياء 1 / دليل التجارب العلمية' },
                  { h2: 'مقرر الكيمياء 1 / كتاب الطالب' },
                ],
              },
              {
                title: 'الأحياء 1',
                books: [
                  { h2: 'مقرر الأحياء 1 / دليل التجارب العلمية' },
                  { h2: 'مقرر الأحياء 1 / كتاب الطالب' },
                ],
              },
              {
                title: 'الكفايات اللغوية 1',
                books: [
                  {
                    h2: 'مقرر الكفايات اللغوية 1-1 / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              
              {
                title: 'علم البيئة',
                books: [
                  { h2: 'مقرر علم البيئة / دليل التجارب العلمية' },
                  { h2: 'مقرر علم البيئة / كتاب الطالب' },
                ],
              },
              {
                title: 'الفيزياء 1',
                books: [
                  { h2: 'مقرر الفيزياء 1 / دليل التجارب العلمية' },
                  { h2: 'مقرر الفيزياء 1 / كتاب الطالب' },
                ],
              },
              
              {
                title: 'القرآن الكريم وتفسيره',
                books: [{ h2: 'مقرر القرآن الكريم وتفسيره / كتاب الطالب' }],
              },
              
              {
                title: 'المعرفة المالية',
                books: [
                  { h2: 'مقرر المعرفة المالية / كتاب الطالب' },
                  { h2: 'financial Literacy / Student book' },
                ],
              }, */
            ],
          },
        ],
      },
      {
        name: 'المسار العام',
        label: 'اختر الصف',
        id: 2,
        content: [
          {
            name: 'السنة الثانية',
            label: 'اختر الفصل',
            id: 1,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [
                  {
                    title: 'الرياضيات 2',
                    books: [
                      { h2: 'مقرر_الرياضيات_2-2_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                  {
                    title: 'الفيزياء 2',
                    books: [
                      { h2: 'مقرر_الفيزياء_2_-_كتاب_الطالب_الحزء_الثاني' },
                    ],
                  },
                  {
                    title: 'الكيمياء 2',
                    books: [
                      { h2: 'مقرر_الكيمياء_2-2_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                  {
                    title: 'الأحياء 2',
                    books: [
                      { h2: 'مقرر_الأحياء_2-2_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                  {
                    title: 'اللغة الإنجليزية',
                    books: [
                      {
                        h2: 'مقرر_اللغة_الإنغليزية_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'المهارات الرقمية',
                    books: [
                      {
                        h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'الكفايات اللغوية 2',
                    books: [
                      { h2: 'مقرر_كفايات_لغوية_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                  {
                    title: 'التاريخ',
                    books: [{ h2: 'مقرر_التاريخ_-_كتاب_الطالب_الجزء_الثاني' }],
                  },
                  {
                    title: 'التوحيد',
                    books: [{ h2: 'مقرر_التوحيد_-_كتاب_الطالب_الجزء_الثاني' }],
                  },
                  {
                    title: 'الثقافة الصحية',
                    books: [
                      { h2: 'مقرر_الثقافة_الصحية_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                ],
              },
            ],
          },
          {
            name: 'السنة الثالثة',
            label: 'اختر الفصل',
            id: 2,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [
                  {
                    title: 'الرياضيات 3',
                    books: [
                      { h2: 'مقرر_الرياضيات_2-3_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                  {
                    title: 'الفيزياء 3',
                    books: [
                      { h2: 'مقرر_الفيزياء_2-3_-_كتاب_الطالب_الحزء_الثاني' },
                    ],
                  },
                  {
                    title: 'الكيمياء 3',
                    books: [
                      { h2: 'مقرر_الكيمياء_3_-_كتاب_الطالب_الجزء_الثاني' },
                    ],
                  },
                  {
                    title: 'علوم الأرض والفضاء',
                    books: [
                      {
                        h2: 'مقرر_علوم_الأرض_والفضاء_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'اللغة الإنجليزية',
                    books: [
                      {
                        h2: 'مقرر_اللغة_الإنغليزية_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'المهارات الحياتية والأسرية',
                    books: [
                      {
                        h2: 'مقرر_المهارات_الحياتية_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'المهارات الرقمية',
                    books: [
                      {
                        h2: 'مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'الدراسات النفسية',
                    books: [
                      {
                        h2: 'مقرر_الدراسات_النفسية_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'الدراسات الأدبية',
                    books: [
                      {
                        h2: 'مقرر_الدراسات_الأدبية_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'التصميم الرقمي',
                    books: [
                      {
                        h2: 'مقرر_التصميم_الرقمي_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'التنمية المستدامة',
                    books: [
                      {
                        h2: 'مقرر_التنمية_المستدامة_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'جغرافيا',
                    books: [
                      {
                        h2: 'مقرر_الجغرافيا_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'الفقه',
                    books: [
                      {
                        h2: 'مقرر_الفقه_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'الكتابة الوظيفية',
                    books: [
                      {
                        h2: 'مقرر_الكتابة_الوظيفية_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'المصادر',
                    books: [
                      {
                        h2: 'مقرر_المصادر_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'المهارات الإدارية',
                    books: [
                      {
                        h2: 'مقرر_المهارات_الإدارية_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                  {
                    title: 'المواطنة',
                    books: [
                      {
                        h2: 'مقرر_المواطنة_-_كتاب_الطالب_الجزء_الثاني',
                      },
                    ],
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        name: 'المسار الشرعي',
        label: 'اختر الصف',
        id: 3,
        content: [
          {
            name: 'السنة الثانية',
            label: 'اختر الفصل',
            id: 1,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
          {
            name: 'السنة الثالثة',
            label: 'اختر الفصل',
            id: 2,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
        ],
      },
      {
        name: 'المسار إدارة أعمال',
        label: 'اختر الصف',
        id: 4,
        content: [
          {
            name: 'السنة الثانية',
            label: 'اختر الفصل',
            id: 1,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
          {
            name: 'السنة الثالثة',
            label: 'اختر الفصل',
            id: 2,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
        ],
      },
      {
        name: 'مسار علوم الحاسب',
        label: 'اختر الصف',
        id: 5,
        content: [
          {
            name: 'السنة الثانية',
            label: 'اختر الفصل',
            id: 1,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
          {
            name: 'السنة الثالثة',
            label: 'اختر الفصل',
            id: 2,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
        ],
      },
      {
        name: 'مسار الصحة والحياة',
        label: 'اختر الصف',
        id: 6,
        content: [
          {
            name: 'السنة الثانية',
            label: 'اختر الفصل',
            id: 1,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
          {
            name: 'السنة الثالثة',
            label: 'اختر الفصل',
            id: 2,
            content: [
              {
                name: 'الفصل الأول',
                label: 'اختر المقرر',
                id: 1,
                content: [],
              },
              {
                name: 'الفصل الثاني',
                label: 'اختر المقرر',
                id: 2,
                content: [],
              },
            ],
          },
        ],
      },
    ],
  },
  {
    name: 'التعليم المستمر',
    id: 4,
    label: 'اختر الصف',
    content: [
      {
        name: 'الصف الأول',
        label: 'اختر الفصل',
        id: 1,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              /* {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر لغتي / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'الرياضيات / كتاب الطالب' }],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [{ h2: 'مقرر الدراسات الإسلامية / كتاب الطالب' }],
              },
              {
                title: 'المهارات الحياتية',
                books: [{ h2: 'المهارات الحياتية / كتاب الطالب' }],
              },
              {
                title: 'التربية الفنية',
                books: [{ h2: 'مقرر التربية الفنية/ كتاب الطالب' }],
              }, */
            ],
          },
        ],
      },
      {
        name: 'الصف الثاني',
        label: 'اختر الفصل',
        id: 2,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              /* {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر لغتي / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'الرياضيات / كتاب الطالب' }],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [{ h2: 'مقرر الدراسات الإسلامية / كتاب الطالب' }],
              },
              {
                title: 'المهارات الحياتية',
                books: [{ h2: 'المهارات الحياتية / كتاب الطالب' }],
              },
              {
                title: 'التربية الفنية',
                books: [{ h2: 'مقرر التربية الفنية/ كتاب الطالب' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'مقرر العلوم / كتاب الطالب' }],
              },
              {
                title: 'اللغة الانجليزية',
                books: [{ h2: 'مقرر اللغة الانجليزية /كتاب الطالب' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [{ h2: 'مقرر الدراسات الاجتماعية / كتاب الطالب' }],
              }, */
            ],
          },
        ],
      },
      {
        name: 'الصف الثالث',
        label: 'اختر الفصل',
        id: 3,
        content: [
          {
            name: 'الفصل الأول',
            label: 'اختر المقرر',
            id: 1,
            content: [],
          },
          {
            name: 'الفصل الثاني',
            label: 'اختر المقرر',
            id: 2,
            content: [
              /* {
                title: 'اللغة العربية',
                books: [
                  {
                    h2: 'مقرر لغتي / كتاب الطالب الجزء الثاني',
                    url: '',
                  },
                ],
              },
              {
                title: 'الرياضيات',
                books: [{ h2: 'الرياضيات / كتاب الطالب' }],
              },
              {
                title: 'القرآن الكريم والدراسات الإسلامية',
                books: [
                  { h2: 'مقرر الدراسات الإسلامية / كتاب الطالب' },
                  {
                    h2: 'مقرر تلاوة القرآن الكريم و تجويده / كتاب الطالب',
                    url: '',
                  },
                ],
              },
              {
                title: 'المهارات الحياتية',
                books: [{ h2: 'المهارات الحياتية / كتاب الطالب' }],
              },
              {
                title: 'التربية الفنية',
                books: [{ h2: 'مقرر التربية الفنية/ كتاب الطالب' }],
              },
              {
                title: 'العلوم',
                books: [{ h2: 'مقرر العلوم / كتاب الطالب' }],
              },
              {
                title: 'اللغة الانجليزية',
                books: [{ h2: 'مقرر اللغة الانجليزية /كتاب الطالب' }],
              },
              {
                title: 'الدراسات الاجتماعية',
                books: [{ h2: 'مقرر الدراسات الاجتماعية / كتاب الطالب' }],
              },
              {
                title: 'الحاسب وتقنية المعلومات',
                books: [{ h2: 'مقرر الحاسب وتقنية المعلومات / كتاب الطالب' }],
              }, */
            ],
          },
        ],
      },
    ],
  },
  /*   {
    name: 'التربية الخاصة',
    id: 5,
    label: 'اختر الصف',
    content: [{ name: '', content: [] }],
  }, */
];

// مقرر_اللغة_العربية_-_كتاب_الطالب_الجزء_الثاني
// مقرر_الرياضيات_-_كتاب_الطالب_الجزء_الثاني
// مقرر_العلوم_-_كتاب_الطالب_الجزء_الثاني
// مقرر_اللغة_الإنغليزية_-_كتاب_الطالب_الجزء_الثاني
// مقرر_التجويد_-_كتاب_الطالب_الجزء_الثاني
// مقرر_التربية_الفنية_-_كتاب_الطالب_الجزء_الثاني
// مقرر_الدراسات_الاجتماعية_-_كتاب_الطالب_الجزء_الثاني
// مقرر_الدراسات_الإسلامية_-_كتاب_الطالب_الجزء_الثاني
// مقرر_المهارات_الحياتية_-_كتاب_الطالب_الجزء_الثاني
// مقرر_المهارات_الرقمية_-_كتاب_الطالب_الجزء_الثاني
